/******************************************************************
** 文件名:varWarn.h
** Copyright (c) 1998-2003*********星宇软件开发股份有限公司
** 编码 :柴若愚    日期:2003-9-18
** 修改人:         日期:
** 描述:本文件提供告警信息提交、处理的接口方法和相关数据结构定义。
** 版本:1.0
**-----------------------------------------------------------------
******************************************************************/

#include "WarnLog.h"

#ifndef	__VARCS_WARNINTERFACE__H
#define __VARCS_WARNINTERFACE__H

/******************************************************************
**类名：CWarnInter
**描述：定义告警信息提交、处理的的统一接口。
******************************************************************/
class AFX_EXT_CLASS CWarnInter  
{
public:

/********************************************************
** 函数名:init
** 参数: 
** 功能描述:初始化告警接口对象
            使用告警接口对象的进程必须首先调用本函数
** 返回值:
          true:操作成功;          false:操作失败
********************************************************/
  virtual bool init() = 0;


/********************************************************
** 函数名:SubmitSOE
** 参数: 
** 功能描述:SOE告警提交。
            本函数主要用于通信接口程序提交子站上传的soe
** 返回值:
          true:操作成功;          false:操作失败
********************************************************/
  virtual bool SubmitSOE(const SOE_WARN &soe) = 0;


/********************************************************
** 函数名:SubmitWarnInfo
** 参数: 
** 功能描述:告警信息提交
            本函数用于varCS系统各程序模块提交告警信息
** 返回值:
          true:操作成功;          false:操作失败
********************************************************/
  virtual bool SubmitWarnInfo(const WARN_INFO &warnInfo) = 0;

  CWarnInter() {}
  virtual ~CWarnInter() {}
};

//告警信息接口输出，通过此对象提交告警信息
AFX_EXT_CLASS CWarnInter *pWarn;

#endif //__VARCS_WARNINTERFACE__H